VARIANT = 7
CSV_PATH = '7.csv'
PATTERNS ={
    'email': r'^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$',
    'height': r'^[12]\.\d{2}$',
    'inn': r'^\d{12}$',
    'passport': r'^\d{2} \d{2} \d{6}$',
    'occupation': r'^[а-яА-ЯёЁa-zA-Z\s\-]+$',
    'latitude': r'^-?(?:90(?:\.0+)?|[1-8]?[0-9](?:\.[0-9]+)?)$',
    'hex_color': r'^#[0-9a-fA-F]{6}$',
    'issn': r'^\d{4}-\d{4}$',
    'uuid': r'^[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}$',
    'time': r'^(?:[01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9](?:\.[0-9]{1,6})?$',
}